In [2]:
import glob
import gzip
import os
import shutil
import sys
import time
import warnings
import zipfile
from datetime import date

import cdsapi
import h5py
import numpy
import numpy as np
import pandas as pd
import urllib3
import xarray

warnings.filterwarnings("ignore")
import pycountry

sys.path.append(os.getcwd() + "/../cds-backend/code/")
import copy
import glob
import json

import cds_eua4 as eua
import numba
import pandas
import psutil
import requests
from numba import njit


def find_nearest(array, value):
    array = np.asarray(array)
    idx = (np.abs(array - value)).argmin()
    return array[idx]


def datetime_to_seconds(dates, ref="1900-01-01T00:00:00"):
    """from datetime64 to seconds since 1900-01-01 00:00:00"""
    return ((dates - np.datetime64(ref)) / np.timedelta64(1, "s")).astype(np.int64)


def seconds_to_datetime(seconds, ref="1900-01-01"):
    """from seconds to datetime64"""
    seconds = np.asarray(seconds)
    return pd.to_datetime(seconds, unit="s", origin=ref)


import matplotlib
import matplotlib.pylab as plt
import matplotlib.pyplot as maplt

matplotlib.rcParams.update({"font.size": 20})
matplotlib.rcParams["figure.figsize"] = (20, 10)
font = {
    "family": "normal",
    # 'weight' : 'bold',
    "size": 22,
}
matplotlib.rc("font", **font)

In [3]:
stations = glob.glob(
    "/scratch/das/federico/MERGED_02APR2023_arctic_giub/*v1.nc"  # 0-20000-0-01107*
)
stations[:10]

['/scratch/das/federico/MERGED_02APR2023_arctic_giub/0-20000-0-03302_CEUAS_merged_v1.nc',
 '/scratch/das/federico/MERGED_02APR2023_arctic_giub/0-20000-0-16224_CEUAS_merged_v1.nc',
 '/scratch/das/federico/MERGED_02APR2023_arctic_giub/0-20000-0-11679_CEUAS_merged_v1.nc',
 '/scratch/das/federico/MERGED_02APR2023_arctic_giub/0-20000-0-41196_CEUAS_merged_v1.nc',
 '/scratch/das/federico/MERGED_02APR2023_arctic_giub/0-20000-0-10361_CEUAS_merged_v1.nc',
 '/scratch/das/federico/MERGED_02APR2023_arctic_giub/0-20400-0-5009_CEUAS_merged_v1.nc',
 '/scratch/das/federico/MERGED_02APR2023_arctic_giub/0-246-0-101103_CEUAS_merged_v1.nc',
 '/scratch/das/federico/MERGED_02APR2023_arctic_giub/0-20300-0-93871_CEUAS_merged_v1.nc',
 '/scratch/das/federico/MERGED_02APR2023_arctic_giub/0-20000-0-07002_CEUAS_merged_v1.nc',
 '/scratch/das/federico/MERGED_02APR2023_arctic_giub/0-20000-0-07093_CEUAS_merged_v1.nc']

In [6]:
bad_stats = []
for stat in stations[:]:
    target_station = glob.glob(
        "/mnt/users/scratch/leo/scratch/converted_v11/long/" + stat.split("/")[-1]
    )[0]

    with eua.CDMDataset(target_station) as file:
        df = file.to_dataframe(
            groups=["observations_table"],
            variables=[
                "date_time",
                "z_coordinate",
                "z_coordinate_type",
                "z_coordinate_method",
                "observed_variable",
                "observation_value",
            ],
        )
    # df["date_time"] = seconds_to_datetime(df.date_time.values)
    df_geo = df[df.observed_variable == 117]
    df_nan = df_geo[np.isnan(df_geo.z_coordinate)]
    if len(df_nan) > 0:
        print(stat)
        print(target_station)
        display(df_nan)
        print()
        bad_stats.append(target_station)
        if len(bad_stats) > 8:
            break

/scratch/das/federico/MERGED_02APR2023_arctic_giub/0-20000-0-20891_CEUAS_merged_v1.nc
/mnt/users/scratch/leo/scratch/converted_v11/long/0-20000-0-20891_CEUAS_merged_v1.nc

,date_time,z_coordinate,z_coordinate_type,z_coordinate_method,observed_variable,observation_value
2400136,1952-05-18 07:11:00,NaN,1,-2147483648,117,1961.329956
2400137,1952-05-18 07:11:00,NaN,1,-2147483648,117,4903.325195
2400138,1952-05-18 07:11:00,NaN,1,-2147483648,117,9806.650391
2400139,1952-05-18 07:11:00,NaN,1,-2147483648,117,14709.974609
2400140,1952-05-18 07:11:00,NaN,1,-2147483648,117,19613.300781
...,...,...,...,...,...,...
2581827,1960-12-31 00:23:00,NaN,1,-2147483648,117,2255.529541
2581828,1960-12-31 00:23:00,NaN,1,-2147483648,117,5197.524414
2581848,1960-12-31 06:22:00,NaN,1,-2147483648,117,1274.864502
2581849,1960-12-31 06:22:00,NaN,1,-2147483648,117,2255.529541
2581850,1960-12-31 06:22:00,NaN,1,-2147483648,117,5197.524414

/scratch/das/federico/MERGED_02APR2023_arctic_giub/0-20000-0-34300_CEUAS_merged_v1.nc
/mnt/users/scratch/leo/scratch/converted_v11/long/0-20000-0-34300_CEUAS_merged_v1.nc

,date_time,z_coordinate,z_coordinate_type,z_coordinate_method,observed_variable,observation_value
4021646,1947-08-28 03:05:00,NaN,1,-2147483648,117,0.000000
4022347,1947-11-24 23:06:00,NaN,1,-2147483648,117,0.000000
4024064,1948-03-23 23:06:00,NaN,1,-2147483648,117,0.000000
4068346,1953-09-24 14:27:00,NaN,1,-2147483648,117,147099.750000
4111245,1955-07-17 14:28:00,NaN,1,-2147483648,117,176519.703125
...,...,...,...,...,...,...
4326780,1960-12-31 00:21:00,NaN,1,-2147483648,117,3334.260986
4326781,1960-12-31 00:21:00,NaN,1,-2147483648,117,6276.255859
4326803,1960-12-31 06:24:00,NaN,1,-2147483648,117,2353.595947
4326804,1960-12-31 06:24:00,NaN,1,-2147483648,117,3334.260986
4326805,1960-12-31 06:24:00,NaN,1,-2147483648,117,6276.255859

/scratch/das/federico/MERGED_02APR2023_arctic_giub/0-20000-0-03171_CEUAS_merged_v1.nc
/mnt/users/scratch/leo/scratch/converted_v11/long/0-20000-0-03171_CEUAS_merged_v1.nc

,date_time,z_coordinate,z_coordinate_type,z_coordinate_method,observed_variable,observation_value
3825507,1957-09-01 06:00:00,NaN,1,-2147483648,117,880.0
3825526,1957-09-01 18:00:00,NaN,1,-2147483648,117,880.0
3825547,1957-09-02 06:00:00,NaN,1,-2147483648,117,880.0
3825569,1957-09-02 18:00:00,NaN,1,-2147483648,117,880.0
3825593,1957-09-03 06:00:00,NaN,1,-2147483648,117,1470.0
...,...,...,...,...,...,...
3975547,1967-12-29 18:00:00,NaN,1,-2147483648,117,880.0
3975567,1967-12-30 06:00:00,NaN,1,-2147483648,117,1470.0
3975583,1967-12-30 18:00:00,NaN,1,-2147483648,117,880.0
3975602,1967-12-31 06:00:00,NaN,1,-2147483648,117,880.0
3975619,1967-12-31 18:00:00,NaN,1,-2147483648,117,880.0

/scratch/das/federico/MERGED_02APR2023_arctic_giub/0-20300-0-04977_CEUAS_merged_v1.nc
/mnt/users/scratch/leo/scratch/converted_v11/long/0-20300-0-04977_CEUAS_merged_v1.nc

,date_time,z_coordinate,z_coordinate_type,z_coordinate_method,observed_variable,observation_value
291234,1948-01-20 15:00:00,NaN,1,-2147483648,117,49033.250000
291235,1948-01-20 15:00:00,NaN,1,-2147483648,117,58839.898438
291236,1948-01-20 15:00:00,NaN,1,-2147483648,117,68646.546875
291237,1948-01-20 15:00:00,NaN,1,-2147483648,117,78453.203125
291238,1948-01-20 15:00:00,NaN,1,-2147483648,117,88259.851562
...,...,...,...,...,...,...
299826,1948-12-31 14:08:00,NaN,1,-2147483648,117,166713.046875
299827,1948-12-31 14:08:00,NaN,1,-2147483648,117,176519.703125
299828,1948-12-31 14:08:00,NaN,1,-2147483648,117,186326.343750
299829,1948-12-31 14:08:00,NaN,1,-2147483648,117,196133.000000
299830,1948-12-31 14:08:00,NaN,1,-2147483648,117,205939.656250

/scratch/das/federico/MERGED_02APR2023_arctic_giub/0-20000-0-41480_CEUAS_merged_v1.nc
/mnt/users/scratch/leo/scratch/converted_v11/long/0-20000-0-41480_CEUAS_merged_v1.nc

,date_time,z_coordinate,z_coordinate_type,z_coordinate_method,observed_variable,observation_value
1522496,1962-10-05 00:00:00,NaN,1,-2147483648,117,1470.0
1525801,1963-01-11 00:00:00,NaN,1,-2147483648,117,880.0
1542262,1964-06-02 00:00:00,NaN,1,-2147483648,117,880.0
1554556,1965-06-05 00:00:00,NaN,1,-2147483648,117,880.0
1554736,1965-06-10 00:00:00,NaN,1,-2147483648,117,1470.0
...,...,...,...,...,...,...
1571649,1966-10-27 06:00:00,NaN,1,-2147483648,117,880.0
1571680,1966-10-28 06:00:00,NaN,1,-2147483648,117,880.0
1571716,1966-10-29 06:00:00,NaN,1,-2147483648,117,880.0
1571758,1966-10-30 06:00:00,NaN,1,-2147483648,117,880.0
1571790,1966-10-31 06:00:00,NaN,1,-2147483648,117,880.0

/scratch/das/federico/MERGED_02APR2023_arctic_giub/0-20000-0-02527_CEUAS_merged_v1.nc
/mnt/users/scratch/leo/scratch/converted_v11/long/0-20000-0-02527_CEUAS_merged_v1.nc

,date_time,z_coordinate,z_coordinate_type,z_coordinate_method,observed_variable,observation_value
44118627,2020-07-28 23:30:06,NaN,1,-2147483648,117,1824.036865
44118628,2020-07-28 23:30:06,NaN,1,-2147483648,117,1745.583740

/scratch/das/federico/MERGED_02APR2023_arctic_giub/0-20001-0-34882_CEUAS_merged_v1.nc
/mnt/users/scratch/leo/scratch/converted_v11/long/0-20001-0-34882_CEUAS_merged_v1.nc

,date_time,z_coordinate,z_coordinate_type,z_coordinate_method,observed_variable,observation_value
13546309,1941-06-20 03:16:00,NaN,1,-2147483648,117,1961.329956
13546310,1941-06-20 03:16:00,NaN,1,-2147483648,117,4903.325195
13546311,1941-06-20 03:16:00,NaN,1,-2147483648,117,9806.650391
13546312,1941-06-20 03:16:00,NaN,1,-2147483648,117,14709.974609
13546313,1941-06-20 03:16:00,NaN,1,-2147483648,117,19613.300781
...,...,...,...,...,...,...
13763145,1958-04-09 18:35:00,NaN,1,-2147483648,117,1765.197021
13763146,1958-04-09 18:35:00,NaN,1,-2147483648,117,4707.191895
13763193,1958-04-10 00:31:00,NaN,1,-2147483648,117,784.531982
13763194,1958-04-10 00:31:00,NaN,1,-2147483648,117,1765.197021
13763195,1958-04-10 00:31:00,NaN,1,-2147483648,117,4707.191895

/scratch/das/federico/MERGED_02APR2023_arctic_giub/0-20000-0-23205_CEUAS_merged_v1.nc
/mnt/users/scratch/leo/scratch/converted_v11/long/0-20000-0-23205_CEUAS_merged_v1.nc

,date_time,z_coordinate,z_coordinate_type,z_coordinate_method,observed_variable,observation_value
20109466,1949-01-21 02:12:00,NaN,1,-2147483648,117,39226.601562
20137675,1952-12-10 02:21:00,NaN,1,-2147483648,117,88259.851562
20137787,1952-12-13 14:11:00,NaN,1,-2147483648,117,88259.851562
20138013,1952-12-21 14:15:00,NaN,1,-2147483648,117,88259.851562
20138116,1952-12-25 02:13:00,NaN,1,-2147483648,117,88259.851562
...,...,...,...,...,...,...
20292184,1960-12-13 00:05:00,NaN,1,-2147483648,117,2059.396484
20292185,1960-12-13 00:05:00,NaN,1,-2147483648,117,5001.391602
20292196,1960-12-13 18:04:00,NaN,1,-2147483648,117,2059.396484
20292197,1960-12-13 18:04:00,NaN,1,-2147483648,117,5001.391602
20292541,1960-12-30 18:05:00,NaN,1,-2147483648,117,1078.731445

/scratch/das/federico/MERGED_02APR2023_arctic_giub/0-20000-0-27612_CEUAS_merged_v1.nc
/mnt/users/scratch/leo/scratch/converted_v11/long/0-20000-0-27612_CEUAS_merged_v1.nc

,date_time,z_coordinate,z_coordinate_type,z_coordinate_method,observed_variable,observation_value
18196505,1946-01-03 18:50:00,NaN,1,-2147483648,117,4903.325195
18196506,1946-01-03 18:50:00,NaN,1,-2147483648,117,9806.650391
18196507,1946-01-03 18:50:00,NaN,1,-2147483648,117,14709.974609
18196508,1946-01-03 18:50:00,NaN,1,-2147483648,117,19613.300781
18196509,1946-01-03 18:50:00,NaN,1,-2147483648,117,24516.625000
...,...,...,...,...,...,...
18313840,1951-04-10 16:40:00,NaN,1,-2147483648,117,196133.000000
18313841,1951-04-10 16:40:00,NaN,1,-2147483648,117,203586.046875
18314264,1951-04-16 04:30:00,NaN,1,-2147483648,117,19613.300781
18319995,1951-06-15 04:30:00,NaN,1,-2147483648,117,29419.949219
18319996,1951-06-15 04:30:00,NaN,1,-2147483648,117,39226.601562

In [9]:
df[df.date_time == "1946-01-03 18:50:00"]

,date_time,z_coordinate,z_coordinate_type,z_coordinate_method,observed_variable,observation_value
18196492,1946-01-03 18:50:00,16800.0,1,-2147483648,117,118954.664062
18196493,1946-01-03 18:50:00,17100.0,1,-2147483648,117,117679.796875
18196494,1946-01-03 18:50:00,19500.0,1,-2147483648,117,110128.679688
18196495,1946-01-03 18:50:00,20200.0,1,-2147483648,117,107873.148438
18196496,1946-01-03 18:50:00,23200.0,1,-2147483648,117,100027.828125
18196497,1946-01-03 18:50:00,23900.0,1,-2147483648,117,98066.500000
18196498,1946-01-03 18:50:00,28100.0,1,-2147483648,117,88259.851562
18196499,1946-01-03 18:50:00,33000.0,1,-2147483648,117,78453.203125
18196500,1946-01-03 18:50:00,38500.0,1,-2147483648,117,68646.546875
18196501,1946-01-03 18:50:00,44600.0,1,-2147483648,117,58839.898438
18196502,1946-01-03 18:50:00,51600.0,1,-2147483648,117,49033.250000
18196503,1946-01-03 18:50:00,59500.0,1,-2147483648,117,39226.601562
18196504,1946-01-03 18:50:00,63000.0,1,-2147483648,117,35303.941406
18196505,1946-01-03 18:50:00,NaN,1,-2147483648,117,4903.325195
18196506,1946-01-03 18:50:00,NaN,1,-2147483648,117,9806.650391
18196507,1946-01-03 18:50:00,NaN,1,-2147483648,117,14709.974609
18196508,1946-01-03 18:50:00,NaN,1,-2147483648,117,19613.300781
18196509,1946-01-03 18:50:00,NaN,1,-2147483648,117,24516.625000
18196510,1946-01-03 18:50:00,NaN,1,-2147483648,117,29419.949219
24985480,1946-01-03 18:50:00,16800.0,1,-2147483648,126,209.449997
24985481,1946-01-03 18:50:00,17100.0,1,-2147483648,126,209.250000
24985482,1946-01-03 18:50:00,19500.0,1,-2147483648,126,207.949997
24985483,1946-01-03 18:50:00,20200.0,1,-2147483648,126,207.949997
24985484,1946-01-03 18:50:00,23200.0,1,-2147483648,126,207.949997
24985485,1946-01-03 18:50:00,23900.0,1,-2147483648,126,208.850006
24985486,1946-01-03 18:50:00,28100.0,1,-2147483648,126,214.250000
24985487,1946-01-03 18:50:00,33000.0,1,-2147483648,126,222.149994
24985488,1946-01-03 18:50:00,38500.0,1,-2147483648,126,230.149994
24985489,1946-01-03 18:50:00,44600.0,1,-2147483648,126,238.149994
24985490,1946-01-03 18:50:00,51600.0,1,-2147483648,126,244.449997
24985491,1946-01-03 18:50:00,59500.0,1,-2147483648,126,251.250000
24985492,1946-01-03 18:50:00,63000.0,1,-2147483648,126,253.449997

##  0-20000-0-01107*

In [31]:
df[np.logical_and(df.date_time == "1925-04-14 09:00:00", df.observed_variable == 117)]

,date_time,z_coordinate,z_coordinate_type,z_coordinate_method,observed_variable,observation_value
158950,1925-04-14 09:00:00,1469.387695,0,-2147483648,117,14409.771484
158951,1925-04-14 09:00:00,2607.142822,0,-2147483648,117,25567.337891
158952,1925-04-14 09:00:00,270.408173,0,-2147483648,117,2651.798096
158953,1925-04-14 09:00:00,765.306152,0,-2147483648,117,7505.089355

In [32]:
df[np.logical_and(df.date_time == "1925-04-14 09:00:00", df.observed_variable == 140)]

,date_time,z_coordinate,z_coordinate_type,z_coordinate_method,observed_variable,observation_value
324293,1925-04-14 09:00:00,1469.387695,0,-2147483648,140,6.894400
324294,1925-04-14 09:00:00,2607.142822,0,-2147483648,140,9.396926
324295,1925-04-14 09:00:00,270.408173,0,-2147483648,140,8.863270
324296,1925-04-14 09:00:00,765.306152,0,-2147483648,140,7.878462

In [33]:
df

,date_time,z_coordinate,z_coordinate_type,z_coordinate_method,observed_variable,observation_value
0,1906-09-05 13:33:00,10750.0,0,-2147483648,106,2.200000e+01
1,1906-09-05 13:33:00,11450.0,0,-2147483648,106,3.500000e+02
2,1906-09-05 13:33:00,11900.0,0,-2147483648,106,2.720000e+02
3,1906-09-05 13:33:00,12300.0,0,-2147483648,106,3.360000e+02
4,1906-09-05 13:33:00,124.0,0,-2147483648,106,0.000000e+00
...,...,...,...,...,...,...
402548,1956-12-31 03:00:00,2100.0,0,-2147483648,140,-2.673109e+00
402549,1956-12-31 03:00:00,300.0,0,-2147483648,140,-9.444492e-07
402550,1956-12-31 03:00:00,3000.0,0,-2147483648,140,8.669847e+00
402551,1956-12-31 03:00:00,600.0,0,-2147483648,140,-6.746066e-07
402552,1956-12-31 03:00:00,900.0,0,-2147483648,140,-8.933160e-01